Tekla Open API Reference for Tekla Structures 2025
AABB Methods
The AABB type exposes the following members.
Methods
Name | Description
Collide
 Checks if the current axis-aligned 3d bounding box collides with another given axis-aligned 3d bounding box. Both axis-aligned 3d bounding boxes need to be in the same coordinate system or in the same workplane, so that they are defined using the same axes.
GetCenterPoint
 Returns the geometric center point of the current axis-aligned 3d bounding box.
GetCornerPoints
 Returns all corner points of the current axis-aligned 3d bounding box.
IsInside(LineSegment)
 Checks if the given line segment is inside the current axis-aligned 3d bounding box.
IsInside(Point)
 Checks if the given point is inside the current axis-aligned 3d bounding box.
Top
See Also
Reference
AABB Class
Tekla.Structures.Geometry3d Namespace